#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.testing will be created
+ resource "digitalocean_kubernetes_cluster" "testing" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "testing"
      + region         = "lon1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + tags           = [
          + "test",
        ]
      + updated_at     = (known after apply)
      + version        = "1.12.1-do.2"

      + node_pool {
          + id         = (known after apply)
          + name       = "one"
          + node_count = 1
          + nodes      = (known after apply)
          + size       = "s-1vcpu-2gb"
          + tags       = [
              + "one",
            ]
        }
    }

  # digitalocean_kubernetes_node_pool.barfoo will be created
+ resource "digitalocean_kubernetes_node_pool" "barfoo" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "two"
      + node_count = 1
      + nodes      = (known after apply)
      + size       = "s-1vcpu-2gb3"
      + tags       = [
          + "two",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions3`*